# Capstone Databases

In [15]:
import sqlite3 as lite
import csv
import pandas as pd
import os

## Read in Data

In [48]:
#Data on quantity and value of field crops produced 
secta3i = pd.read_csv("secta3i_harvestw3.csv")
secta3i = pd.DataFrame(secta3i)
#Community data on respondent characteristics
sectc1 = pd.read_csv("sectc1_harvestw3.csv")
sectc1 = pd.DataFrame(sectc1)

#Data on quantity and value of field crops produced
secta3ii = pd.read_csv("secta3ii_harvestw3.csv")
secta3ii = pd.DataFrame(secta3ii)

## Open Database Connection

In [40]:
##All of these need to be part of the same database but as different tables
conn = lite.connect("nigeria.db")
cur = conn.cursor()

## Convert Pandas Dataframe to SQL Table

In [41]:
secta3i.to_sql("secta3i", conn, if_exists = "replace")
conn.commit()
sectc1.to_sql("sectc1", conn, if_exists = "replace")
secta3ii.to_sql("secta3ii", conn, if_exists = "replace")

## Verifies Database is created

In [49]:
pd.read_sql_query("select * from sectc1 limit 5", conn)

,index,zone,state,sector,lga,ea,serial_no,c1q2,c1q3,c1q4a,c1q4b,c1q4_os,c1q5,c1q6
0,0,4,1,1,102,536,1,1,78,1,8.0,None,39,26
1,1,4,1,1,102,536,2,1,52,3,11.0,civil servant,52,26
2,2,4,1,1,102,536,3,2,54,11,NaN,civil servant,36,41
3,3,4,1,1,102,536,4,1,45,12,8.0,None,45,26
4,4,4,1,1,102,536,5,1,53,8,3.0,None,32,42

## Closes Connection

In [50]:
conn.close()